Revit 2026 API

# FilterGlobalParameterAssociationRule Class

---

A filter rule that operates on global parameters ElementId values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterGlobalParameterAssociationRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterGlobalParameterAssociationRule : FilterNumericValueRule
```
```vb
Public Class FilterGlobalParameterAssociationRule
	Inherits FilterNumericValueRule
```
```cpp
public ref class FilterGlobalParameterAssociationRule : public FilterNumericValueRule
```
```fsharp
type FilterGlobalParameterAssociationRule =
    class
        inherit FilterNumericValueRule
    end
```

The FilterGlobalParameterAssociationRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterGlobalParameterAssociationRule | Constructs an instance of FilterGlobalParameterAssociationRule. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |
|  | RuleValue | The user-supplied global parameter value against which values from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterRule) |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from FilterRule) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. (Inherited from FilterNumericValueRule) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from FilterRule) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. (Inherited from FilterNumericValueRule) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace